// 정주호 250923
/* 구구단 출력
	1단 2단 3단
	===========
	4단 5단	6단
	===========
	7단 8단 9단
*/
#include <iostream>
using namespace std;
int main()
{
	int total;
	int iNo, multipler;
	for (int k = 1; k < 4; ++k)
	{
		int wholeloop = 2 * k - 2;
		for (int j = 1; j < 10; ++j)
		{
			for (int i = 1; i < 4; ++i)
			{
				iNo = i + wholeloop;
				multipler = j;
				total = iNo * multipler;
				cout << iNo << "X" << multipler << "=" << total << "\t";
			}
			cout << endl;
		}
		cout << "=========================" << endl;

	}

}
/*
1X1=1     2X1=2     3X1=3
1X2=2     2X2=4     3X2=6
1X3=3     2X3=6     3X3=9
1X4=4     2X4=8     3X4=12
1X5=5     2X5=10     3X5=15
1X6=6     2X6=12     3X6=18
1X7=7     2X7=14     3X7=21
1X8=8     2X8=16     3X8=24
1X9=9     2X9=18     3X9=27
=========================
4X1=4     5X1=5     6X1=6
4X2=8     5X2=10     6X2=12
4X3=12     5X3=15     6X3=18
4X4=16     5X4=20     6X4=24
4X5=20     5X5=25     6X5=30
4X6=24     5X6=30     6X6=36
4X7=28     5X7=35     6X7=42
4X8=32     5X8=40     6X8=48
4X9=36     5X9=45     6X9=54
=========================
7X1=7     8X1=8     9X1=9
7X2=14     8X2=16     9X2=18
7X3=21     8X3=24     9X3=27
7X4=28     8X4=32     9X4=36
7X5=35     8X5=40     9X5=45
7X6=42     8X6=48     9X6=54
7X7=49     8X7=56     9X7=63
7X8=56     8X8=64     9X8=72
7X9=63     8X9=72     9X9=81
=========================
*/